 <img src="https://eant.tech/imagenes/logo.png" width=25% height=80%  >

## <img src="http://icons.iconarchive.com/icons/cornmanthe3rd/plex/256/Other-python-icon.png" width="40"> Ejercicio Restaurant üçùüçïüçü

<center>
<img src="https://i.ibb.co/ySBJX7L/25746.png" alt="25746" border="0" width="80%" height="50%">
</center>

üîπ 1. Importar los paquetes que vamos a utilizar.

In [1]:
import pandas as pd
import plotly.express as px


üîπ 2. Importar el dataframe tips

In [2]:
data = px.data.tips()

In [3]:
data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

üîπ 3. Obtener las variables num√©ricas: la cantidad, promedio, m√≠nimos, m√°ximos y cuartiles.

In [6]:
data.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000


üîπ 4. Agregar a los valores calculados en el paso anterior los percentiles: 0.1,0.25, 0.35, 0.5 y 0.8

In [8]:
data.describe(percentiles=[0.1,0.25, 0.35, 0.5, 0.8, 0.9])

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
10%     10.340000    1.500000    2.000000
25%     13.347500    2.000000    2.000000
35%     15.423000    2.181000    2.000000
50%     17.795000    2.900000    2.000000
80%     26.098000    4.000000    3.000000
90%     32.235000    5.000000    4.000000
max     50.810000   10.000000    6.000000


üîπ 5. Generar un objeto denominado df_tips en el cual se agrupen los datos por la variable `day`

In [9]:
df_tips = data.groupby("day")

In [10]:
df_tips


üîπ 6. Que tipo de datos es df_tips?

In [11]:
type(df_tips)

pandas.core.groupby.generic.DataFrameGroupBy

üîπ 7. Imprimir los grupos generados

In [12]:
df_tips.groups

{'Fri': [90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 220, 221, 222, 223, 224, 225, 226], 'Sat': [19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 168, 169, 170, 171, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242], 'Sun': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 112, 113, 114, 115, 116, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190], 'Thur': [77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 243]}

In [13]:
data

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

üîπ 8. Agrupar los datos por la variable denominada `sex` y obtener la suma de todas las variables num√©ricas.

In [14]:
data.groupby("sex").sum()

        total_bill     tip  size
sex
Female     1570.95  246.51   214
Male       3256.82  485.07   413

üîπ 9. Agrupar los datos por la variable denominada `sex` y `smoker`, posteriormente obtener la suma de todas las variables num√©ricas.

In [17]:
data.groupby(["sex", "smoker"]).sum()

               total_bill     tip  size
sex    smoker
Female No          977.68  149.77   140
       Yes         593.27   96.74    74
Male   No         1919.75  302.00   263
       Yes        1337.07  183.07   150

üîπ 10. Generar un dataframe con los datos agrupados en el punto anterior.

In [18]:
tips_ = pd.DataFrame(data.groupby(["sex", "smoker"]).sum())

In [19]:
tips_

               total_bill     tip  size
sex    smoker
Female No          977.68  149.77   140
       Yes         593.27   96.74    74
Male   No         1919.75  302.00   263
       Yes        1337.07  183.07   150

In [20]:
tips_ = pd.DataFrame(data.groupby(["sex", "smoker"], as_index = False).sum())

In [21]:
tips_

      sex smoker  total_bill     tip  size
0  Female     No      977.68  149.77   140
1  Female    Yes      593.27   96.74    74
2    Male     No     1919.75  302.00   263
3    Male    Yes     1337.07  183.07   150

üîπ 11. Generar un dataframe el mismo dataframe que en el paso anterior pero:
* Variable `tip`calcular el promedio.
* Variable `size`calcular la sumatoria.
* Variable `total_bill`calcular:
 + maximo
 + sumatoria
 + minimos

In [23]:
data.groupby(["sex", "smoker"], as_index=False)["total_bill", "tip"].sum()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning:

Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.

      sex smoker  total_bill     tip
0  Female     No      977.68  149.77
1  Female    Yes      593.27   96.74
2    Male     No     1919.75  302.00
3    Male    Yes     1337.07  183.07

In [73]:
tips_ = pd.DataFrame(
   data
       .groupby(["sex", "smoker"], as_index = False)
       .agg({"tip" : "mean", "size" : "sum", "total_bill" : [max, min, sum]})


)

In [67]:
tips_.columns = tips_.columns.get_level_values(0)

In [72]:
tips_

      sex smoker       tip size total_bill
                      mean  sum        max   min      sum
0  Female     No  2.773519  140      35.83  7.25   977.68
1  Female    Yes  2.931515   74      44.30  3.07   593.27
2    Male     No  3.113402  263      48.33  7.51  1919.75
3    Male    Yes  3.051167  150      50.81  7.25  1337.07

In [37]:
tips_ = tips_.rename(columns = {"total_bill" : "total"})

üîπ 12. Generar una nueva columna denominado `Mpromedio` en la cual retorne un true si supera a la propina promedio y un false si no la supera.

In [46]:
data["Mpromedio"] = data["tip"]>data["tip"].mean()

In [41]:
data.head()

   total_bill   tip     sex smoker  day    time  size  Mpromedio
0       16.99  1.01  Female     No  Sun  Dinner     2      False
1       10.34  1.66    Male     No  Sun  Dinner     3      False
2       21.01  3.50    Male     No  Sun  Dinner     3       True
3       23.68  3.31    Male     No  Sun  Dinner     2       True
4       24.59  3.61  Female     No  Sun  Dinner     4       True

In [42]:
data["tip"].mean()

2.9982786885245902

üîπ 13. Modificar la variables generada en el paso anterior para:
* `True` modificar por `Mayor`
* `False` modificar por `Menor`

In [47]:
import numpy as np

In [48]:
data["Mpromedio"] = np.where(data["Mpromedio"] == True, "Mayor", "Menor")

In [49]:
data.head()

   total_bill   tip     sex smoker  day    time  size Mpromedio
0       16.99  1.01  Female     No  Sun  Dinner     2     Menor
1       10.34  1.66    Male     No  Sun  Dinner     3     Menor
2       21.01  3.50    Male     No  Sun  Dinner     3     Mayor
3       23.68  3.31    Male     No  Sun  Dinner     2     Mayor
4       24.59  3.61  Female     No  Sun  Dinner     4     Mayor

üîπ 14. Calcular la cantidad de valores que ya para la variable `MayorPromedio`

In [51]:
data.Mpromedio.value_counts(normalize = True)

Menor    0.504098
Mayor    0.495902
Name: Mpromedio, dtype: float64

üîπ 15. Generar un dataframe denominado `gpgroup` que se agrupe por las variables `sex`y `time`, calculando  el promedio por las variables num√©ricas

In [52]:
gpgroup = pd.DataFrame(data.groupby(["sex", "time"], as_index= False).mean())
gpgroup

      sex    time  total_bill       tip      size
0  Female  Dinner   19.213077  3.002115  2.461538
1  Female   Lunch   16.339143  2.582857  2.457143
2    Male  Dinner   21.461452  3.144839  2.701613
3    Male   Lunch   18.048485  2.882121  2.363636